app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "8408804184"], ["twitter", "none"], ["updated_at", "2022-09-26 06:33:35.559822"], ["id", 1]]